tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
cask "java"
brew "ansible"
brew "autojump"
brew "cmake"
brew "ctags"
brew "diff-so-fancy"
brew "elasticsearch"
brew "fswatch"
brew "ghostscript"
brew "git"
brew "gnu-sed"
brew "imagemagick"
brew "kibana"
brew "mas"
brew "neovim"
brew "node"
brew "phantomjs"
brew "python3"
brew "postgresql", restart_service: true
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tree"
brew "unrar"
brew "wget"
brew "zsh"
cask "cleanmymac"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "ksdiff"
cask "screenhero"
cask "skype"
cask "slack"
cask "spotify"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "windscribe"
mas "1Password", id: 443987910
mas "BetterSnapTool", id: 417375580
mas "Kaleidoscope", id: 587512244
