require 'socket'
hostname = Socket.gethostname

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/versions"
tap "caskroom/cask"
cask "caskroom/versions/java8"
brew "ansible"
brew "autojump"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "diff-so-fancy"
brew "elasticsearch"
brew "findutils"
brew "gawk"
brew "git"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gzip"
brew "imagemagick"
brew "kibana" unless hostname == 'nathan'
brew "mas"
brew "neovim"
brew "node"
brew "openconnect" unless hostname == 'nathan'
brew "openssh"
brew "phantomjs"
brew "postgresql", restart_service: true
brew "python"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tree"
brew "unrar"
brew "unzip"
brew "wget"
brew "zsh"
cask "cleanmymac" if hostname == 'nathan'
cask "dropbox"
cask "evernote"
cask "expressvpn" if hostname == 'nathan'
cask "firefox", args: { appdir: '/Applications' }
cask "google-chrome", args: { appdir: '/Applications' }
cask "iterm2"
cask "java"
if hostname == 'nathan'
  cask "spotify"
  cask "transmission"
  cask "vagrant"
  cask "virtualbox"
  cask "vlc"
end
mas "1Password", id: 443987910
mas "BetterSnapTool", id: 417375580
